package io.wispforest.owo.util;

public final class KawaiiUtil {
   private static final String[] kaomoji = "(* ^ ω ^)\n(´ ∀ ` *)\n٩(◕‿◕｡)۶\n☆*:.｡.o(≧▽≦)o.｡.:*☆\n(o^▽^o)\n(⌒▽⌒)☆\n<(￣︶￣)>\n。.:☆*:･'(*⌒―⌒*)))\nヽ(・∀・)ﾉ\n(´｡• ω •｡`)\n(￣ω￣)\n｀;:゛;｀;･(°ε° )\n(o･ω･o)\n(＠＾◡＾)\nヽ(*・ω・)ﾉ\n(o_ _)ﾉ彡☆\n(^人^)\n(o´▽`o)\n(*´▽`*)\n｡ﾟ( ﾟ^∀^ﾟ)ﾟ｡\n( ´ ω ` )\n(((o(*°▽°*)o)))\n(≧◡≦)\n(o´∀`o)\n(´• ω •`)\n(＾▽＾)\n(⌒ω⌒)\n∑d(°∀°d)\n╰(▔∀▔)╯\n(─‿‿─)\n(*^‿^*)\nヽ(o^ ^o)ﾉ\n(✯◡✯)\n(◕‿◕)\n(*≧ω≦*)\n(☆▽☆)\n(⌒‿⌒)\n＼(≧▽≦)／\nヽ(o＾▽＾o)ノ\n☆ ～('▽^人)\n(*°▽°*)\n٩(｡•́‿•̀｡)۶\n(✧ω✧)\nヽ(*⌒▽⌒*)ﾉ\n(´｡• ᵕ •｡`)\n( ´ ▽ ` )\n(￣▽￣)\n╰(*´︶`*)╯\nヽ(>∀<☆)ノ\no(≧▽≦)o\n(☆ω☆)\n(っ˘ω˘ς )\n＼(￣▽￣)／\n(*¯︶¯*)\n＼(＾▽＾)／\n٩(◕‿◕)۶\n(o˘◡˘o)\n\\(★ω★)/\n\\(^ヮ^)/\n(〃＾▽＾〃)\n(╯✧▽✧)╯\no(>ω<)o\no( ❛ᴗ❛ )o\n｡ﾟ(TヮT)ﾟ｡\n( ‾́ ◡ ‾́ )\n(ﾉ´ヮ`)ﾉ*: ･ﾟ\n(b ᵔ▽ᵔ)b\n(๑˃ᴗ˂)ﻭ\n(๑˘︶˘๑)\n( ˙꒳˙ )\n(*꒦ິ꒳꒦ີ)\n°˖✧◝(⁰▿⁰)◜✧˖°\n(´･ᴗ･ ` )\n(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧\n(„• ֊ •„)\n(.❛ ᴗ ❛.)\n(⁀ᗢ⁀)\n(￢‿￢ )\n(¬‿¬ )\n(*￣▽￣)b\n( ˙▿˙ )\n(¯▿¯)\n( ◕▿◕ )\n＼(٥⁀▽⁀ )／\n(„• ᴗ •„)\n(ᵔ◡ᵔ)\n( ´ ▿ ` )\n(づ￣ ³￣)づ\n(つ≧▽≦)つ\n(つ✧ω✧)つ\n(づ ◕‿◕ )づ\n(⊃｡•́‿•̀｡)⊃\n(つ . •́ _ʖ •̀ .)つ\n(っಠ‿ಠ)っ\n(づ◡﹏◡)づ\n⊂(´• ω •`⊂)\n⊂(･ω･*⊂)\n⊂(￣▽￣)⊃\n⊂( ´ ▽ ` )⊃\n( ~*-*)~\n(^_~)\n( ﾟｏ⌒)\n(^_-)≡☆\n(^ω~)\n(>ω^)\n(~人^)\n(^_-)\n( -_・)\n(^_<)〜☆\n(^人<)〜☆\n☆⌒(≧▽° )\n☆⌒(ゝ。∂)\n(^_<)\n(^_−)☆\n(･ω<)☆\n(^.~)☆\n(^.~)\n(ﾉ´ з `)ノ\n(♡μ_μ)\n(*^^*)♡\n☆⌒ヽ(*'､^*)chu\n(♡-_-♡)\n(￣ε￣＠)\nヽ(♡‿♡)ノ\n( ´ ∀ `)ノ～ ♡\n(─‿‿─)♡\n(´｡• ᵕ •｡`) ♡\n(*♡∀♡)\n(｡・//ε//・｡)\n(´ ω `♡)\n♡( ◡‿◡ )\n(◕‿◕)♡\n(/▽＼*)｡o○♡\n(ღ˘⌣˘ღ)\n(♡°▽°♡)\n♡(｡- ω -)\n♡ ～('▽^人)\n(´• ω •`) ♡\n(´ ε ` )♡\n(´｡• ω •｡`) ♡\n( ´ ▽ ` ).｡ｏ♡\n╰(*´︶`*)╯♡\n(*˘︶˘*).｡.:*♡\n(♡˙︶˙♡)\n♡＼(￣▽￣)／♡\n(≧◡≦) ♡\n(⌒▽⌒)♡\n(*¯ ³¯*)♡\n(っ˘з(˘⌣˘ ) ♡\n♡ (˘▽˘>ԅ( ˘⌣˘)\n( ˘⌣˘)♡(˘⌣˘ )\n(/^-^(^ ^*)/ ♡\n٩(♡ε♡)۶\nσ(≧ε≦σ) ♡\n♡ (⇀ 3 ↼)\n♡ (￣З￣)\n(´♡‿♡`)\n(°◡°♡)\nΣ>―(〃°ω°〃)♡→\n(´,,•ω•,,)♡\n(´꒳`)♡\n"
      .split("\n");

   private KawaiiUtil() {
   }

   public static String uwuify(String string) {
      return string + " " + uwuGen();
   }

   public static String uwuGen() {
      return kaomoji[(int)(Math.random() * (kaomoji.length - 1))];
   }
}
